Revit 2026 API

# ElementGetChangeTypeParameter(Parameter) Method

---

Returns ChangeType associated with a change in a parameter's value

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ChangeType GetChangeTypeParameter(
	Parameter param
)
```
```vb
Public Shared Function GetChangeTypeParameter (
	param As Parameter
) As ChangeType
```
```cpp
public:
static ChangeType^ GetChangeTypeParameter(
	Parameter^ param
)
```
```fsharp
static member GetChangeTypeParameter :
        param : Parameter -> ChangeType
```

#### Parameters

param Parameter
     Parameter for the ChangeType to trigger on

#### Return Value

ChangeType ChangeType that can be used to define a trigger for an Updater, triggering on parameter value change

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was |

Use this change type to trigger an Updater when the value of an element's parameter changes. Note: This change type will not trigger on newly created or deleted elements.

#### Reference

Element Class

GetChangeTypeParameter Overload

Autodesk.Revit.DB Namespace